In [1]:
import pandas as pd
data=pd.read_csv("pandas.csv")

In [2]:
print(data)

   name  id  marks
0   ram   1     90
1  sita   7     67
2  janu   5     88
3  ravi   9     99
4   jay   6    100

In [3]:
data["id"].max()

9

In [4]:
data["marks"].min()

67

In [6]:
data.head(3)

   name  id  marks
0   ram   1     90
1  sita   7     67
2  janu   5     88

In [7]:
data.tail(2)

   name  id  marks
3  ravi   9     99
4   jay   6    100

In [8]:
data[["name","id"]]

   name  id
0   ram   1
1  sita   7
2  janu   5
3  ravi   9
4   jay   6

In [10]:
data["id"]>2

0    False
1     True
2     True
3     True
4     True
Name: id, dtype: bool

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   id      5 non-null      int64
 2   marks   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [12]:
data[data["id"]>2]

   name  id  marks
1  sita   7     67
2  janu   5     88
3  ravi   9     99
4   jay   6    100

In [13]:
data.describe()

             id       marks
count  5.000000    5.000000
mean   5.600000   88.800000
std    2.966479   13.292855
min    1.000000   67.000000
25%    5.000000   88.000000
50%    6.000000   90.000000
75%    7.000000   99.000000
max    9.000000  100.000000

In [14]:
type(data)

pandas.core.frame.DataFrame

In [15]:
d=data.head(4)

In [16]:
print(d)

   name  id  marks
0   ram   1     90
1  sita   7     67
2  janu   5     88
3  ravi   9     99

In [18]:
f=d.tail(2)
f

   name  id  marks
2  janu   5     88
3  ravi   9     99

In [1]:
import pandas as pd
data=pd.read_csv("pandas.csv")
print(data)
data["address"]=["aaa","bbb","cccc","dddd","eee"]
data

   name  id  marks
0   ram   1     90
1  sita   7     67
2  janu   5     88
3  ravi   9     99
4   jay   6    100

   name  id  marks address
0   ram   1     90     aaa
1  sita   7     67     bbb
2  janu   5     88    cccc
3  ravi   9     99    dddd
4   jay   6    100     eee

In [2]:
data.loc[1]

name       sita
id            7
marks        67
address     bbb
Name: 1, dtype: object

In [3]:
data.loc[1,"name"]

'sita'

In [4]:
newdata=data[(data.id>1)&(data.marks>60)]
print(newdata)

   name  id  marks address
1  sita   7     67     bbb
2  janu   5     88    cccc
3  ravi   9     99    dddd
4   jay   6    100     eee

In [5]:
newdata["name"]

1    sita
2    janu
3    ravi
4     jay
Name: name, dtype: object

In [6]:
import pandas as pd
data=pd.read_csv('pandas.csv',index_col=0)

In [7]:
data

      id  marks
name
ram    1     90
sita   7     67
janu   5     88
ravi   9     99
jay    6    100

In [8]:
import pandas as pd
data=pd.read_csv("pandas.csv")

In [9]:
data

   name  id  marks
0   ram   1     90
1  sita   7     67
2  janu   5     88
3  ravi   9     99
4   jay   6    100

In [10]:
## getting index (row lables)of the dataframes
data.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
##grt column labels of dataframes
data.columns

Index(['name', 'id', 'marks'], dtype='object')

In [12]:
## get the total no of elements from the df
data.size

15

In [13]:
data.shape ## rows nd columns

(5, 3)

In [14]:
##the memory usage of each column in bytes
data.memory_usage()

Index    128
name      40
id        40
marks     40
dtype: int64

In [15]:
## get the dimensions
data.ndim

2

In [17]:
## if we are sure at col name in ths table we use at function
data.at[3,"name"]

'ravi'

In [21]:
#iat provides integer-based lookups,used when we r not sure at col,name// have to give row n col as parameters
data.iat[2,1]

5

In [24]:
# to access a grp of rows n col by labels .loc[] can be used
data.loc[:"id"]

   name  id  marks
0   ram   1     90
1  sita   7     67
2  janu   5     88
3  ravi   9     99
4   jay   6    100